1s/ERP/Conf/InformationRegisters/Лико_СтоимостьЦеновыхГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_СтоимостьЦеновыхГрупп</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОстаток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КроссКурс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаОстатокКрос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_АвтоРасчетЦенЦГ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_АвтоРасчетЦенЦГ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвтоРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЦеныГруппНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЦеныГруппНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотериНаРезке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладскиеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Экосбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_РегистраторыЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоРасчетЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПараметрыРасчетаНормативов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СИМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыВПути</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяЕвро</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенаПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табаш</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабашФакт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_УстановкаСтоимостиЦеновыхГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_УстановкаСтоимостиЦеновыхГрупп</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_СтоимостьЦеновыхГрупп</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_СтоимостьЦеновыхГрупп/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс


Процедура ЗаписатьСтоимтостьЦеновыхГрупп(Организация, Регистратор) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию(); 
	ЗаказПоставщику=Документы.ЗаказПоставщику.ПустаяСсылка();
	Рассчитывается=Ложь;
	
	НаборЗаписей = РегистрыСведений.Лико_СтоимостьЦеновыхГрупп.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Записать(); 

	
	УдалитьЗаписиВРегистреЛико_ЦеныГруппНоменклатурыПоОснованию(Регистратор);
	

	
	
	Если ТипЗнч(Регистратор)=Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		ЗаказПоставщику=Регистратор.Распоряжение; 
		Если ЗначениеЗаполнено(ЗаказПоставщику) 
			И   ТипЗнч(ЗаказПоставщику)=Тип("ДокументСсылка.ЗаказПоставщику")Тогда
			
			Рассчитывается=Истина; 
		Иначе
			
			Возврат;			
			
		КонецЕсли;		
	КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	СУММА(Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Цена) КАК Цена,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|				ТОГДА Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Ссылка.Валюта
	|			ИНАЧЕ Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Валюта
	|		КОНЕЦ) КАК Валюта,
	|	0 КАК Количество
	|ПОМЕСТИТЬ ВтЦеновыеГруппы
	|ИЗ
	|	Документ.Лико_УстановкаСтоимостиЦеновыхГрупп.ЦеновыеГруппы КАК Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы
	|ГДЕ
	|	Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Ссылка = &Регистратор
	|	И Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_УстановкаСтоимостиЦеновыхГруппЦеновыеГруппы.ЦеноваяГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ЦеноваяГруппа,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.Валюта,
	|	СУММА(ПриходныйОрдерНаТоварыТовары.Количество)
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПоставщикуТовары.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|		ВЫБОР
	|			КОГДА ЗаказПоставщикуТовары.Ссылка.Лико_ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|				ТОГДА ЗаказПоставщикуТовары.Ссылка.Валюта
	|			ИНАЧЕ ЗаказПоставщикуТовары.Ссылка.Лико_ВалютаРасчета
	|		КОНЕЦ КАК Валюта,
	|		МАКСИМУМ(ЗаказПоставщикуТовары.Лико_ЦенаИтого) КАК Цена
	|	ИЗ
	|		Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_АвтоРасчетЦенЦГ.СрезПоследних(&Период, ) КАК Лико_АвтоРасчетЦенЦГСрезПоследних
	|			ПО ЗаказПоставщикуТовары.Ссылка.Организация = Лико_АвтоРасчетЦенЦГСрезПоследних.Организация
	|				И ЗаказПоставщикуТовары.Номенклатура.ЦеноваяГруппа = Лико_АвтоРасчетЦенЦГСрезПоследних.ЦеноваяГруппа
	|	ГДЕ
	|		ЗаказПоставщикуТовары.Ссылка = &ЗаказПоставщику
	|		И Лико_АвтоРасчетЦенЦГСрезПоследних.АвтоРасчет
	|		И ЗаказПоставщикуТовары.Номенклатура.ЦеноваяГруппа <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказПоставщикуТовары.Номенклатура.ЦеноваяГруппа,
	|		ВЫБОР
	|			КОГДА ЗаказПоставщикуТовары.Ссылка.Лико_ВалютаРасчета = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|				ТОГДА ЗаказПоставщикуТовары.Ссылка.Валюта
	|			ИНАЧЕ ЗаказПоставщикуТовары.Ссылка.Лико_ВалютаРасчета
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|		ПО ВложенныйЗапрос.ЦеноваяГруппа = ПриходныйОрдерНаТоварыТовары.Номенклатура.ЦеноваяГруппа
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Регистратор
	|	И ПриходныйОрдерНаТоварыТовары.Ссылка.Проведен
	|	И ПриходныйОрдерНаТоварыТовары.Ссылка.Склад.Лико_ТипСклада <> &Лико_ТипСклада
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ЦеноваяГруппа,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	МАКСИМУМ(ВтЦеновыеГруппы.Цена) КАК Цена,
	|	МАКСИМУМ(ВтЦеновыеГруппы.Валюта) КАК Валюта,
	|	СУММА(ВтЦеновыеГруппы.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтЦГСГруп
	|ИЗ
	|	ВтЦеновыеГруппы КАК ВтЦеновыеГруппы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЦеновыеГруппы.ЦеноваяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЦГСГруп.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВтЦГСГруп.Цена КАК Цена,
	|	ВтЦГСГруп.Валюта КАК Валюта,
	|	ВтЦГСГруп.Количество КАК Количество,
	|	СУММА(ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток * ТоварыВЯчейкахОстатки.Упаковка.Числитель, 0)) КАК КоличествоОстаток,
	|	ЕСТЬNULL(Лико_СтоимостьЦеновыхГруппСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаОстаток,
	|	ЕСТЬNULL(Лико_СтоимостьЦеновыхГруппСрезПоследних.Цена, 0) КАК ЦенаОстаток
	|ИЗ
	|	ВтЦГСГруп КАК ВтЦГСГруп
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				&Период,
	|				Ячейка.Лико_Организация = &Организация
	|					И Номенклатура.ЦеноваяГруппа В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВтЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа
	|						ИЗ
	|							ВтЦеновыеГруппы КАК ВтЦеновыеГруппы)) КАК ТоварыВЯчейкахОстатки
	|		ПО ВтЦГСГруп.ЦеноваяГруппа = ТоварыВЯчейкахОстатки.Номенклатура.ЦеноваяГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СтоимостьЦеновыхГрупп.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И ЦеноваяГруппа В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВтЦеновыеГруппы.ЦеноваяГруппа КАК ЦеноваяГруппа
	|						ИЗ
	|							ВтЦеновыеГруппы КАК ВтЦеновыеГруппы)) КАК Лико_СтоимостьЦеновыхГруппСрезПоследних
	|		ПО ВтЦГСГруп.ЦеноваяГруппа = Лико_СтоимостьЦеновыхГруппСрезПоследних.ЦеноваяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЦГСГруп.ЦеноваяГруппа,
	|	ВтЦГСГруп.Цена,
	|	ВтЦГСГруп.Валюта,
	|	ВтЦГСГруп.Количество,
	|	ЕСТЬNULL(Лико_СтоимостьЦеновыхГруппСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)),
	|	ЕСТЬNULL(Лико_СтоимостьЦеновыхГруппСрезПоследних.Цена, 0)";
	Запрос.УстановитьПараметр("Организация",Организация ); 
	Запрос.УстановитьПараметр("Регистратор",Регистратор );
	Запрос.УстановитьПараметр("ЗаказПоставщику",ЗаказПоставщику ); 
	Запрос.УстановитьПараметр("Период",Регистратор.Дата );
    Запрос.УстановитьПараметр("Лико_ТипСклада",Перечисления.Лико_ТипСклада.ТоварыВПути);	
	
	Параметры = Новый Массив(2);
	Параметры[0] = Регистратор.Дата;
	Параметры[1] = ВидГраницы.Включая;
	Граница = Новый(Тип("Граница"),Параметры);
	
	Запрос.УстановитьПараметр("Период",Граница );
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не РегистрыСведений.Лико_АвтоРасчетЦенЦГ.Установлен(
			Организация,
			Выборка.ЦеноваяГруппа,
			КонецДня(Регистратор.Дата)) Тогда
			
			Продолжить; 
			
		КонецЕсли;
		
		
		Если Не Рассчитывается 
			Или  Выборка.Количество>0 
			И  (Выборка.Валюта<>Выборка.ВалютаОстаток 
			Или Выборка.Цена<>Выборка.ЦенаОстаток)Тогда
			
			Запись					=	НаборЗаписей.Добавить();
			Запись.Период			=	Регистратор.Дата;
			Запись.Валюта			=	Выборка.Валюта;
			Запись.ЦеноваяГруппа	=	Выборка.ЦеноваяГруппа;
			Запись.ЗаказПоставщику	=	ЗаказПоставщику;
			Запись.Организация		=	Организация;
			Запись.ЦенаОстаток		=	Выборка.ЦенаОстаток;
			
			Если Рассчитывается Тогда
				Запись.КоличествоПриход =   Выборка.Количество;
				Запись.ЦенаПриход	 =   Выборка.Цена;	
				
			КонецЕсли;
			
			
			Запись.Количество=Выборка.Количество;
			Запись.КоличествоОСтаток=?(Выборка.КоличествоОСтаток=0,Выборка.Количество,Выборка.КоличествоОСтаток-Выборка.Количество);
			Запись.ВалютаОстаток=Выборка.ВалютаОстаток;
			
			Запись.Рассчитывается=Рассчитывается;
			Если Рассчитывается И Запись.КоличествоОСтаток<>0 Тогда
				Массив = Новый Массив();
				Массив.Добавить(Новый Структура("Цена,Валюта,Количество",Выборка.Цена,Выборка.Валюта,Выборка.Количество));
				Массив.Добавить(Новый Структура("Цена,Валюта,Количество",Выборка.ЦенаОстаток,Выборка.ВалютаОстаток,Выборка.КоличествоОстаток-Выборка.Количество));
				
				СредняяЦена=РассчитатьСреденеВзвешеннуюЦену(Массив,Выборка.Валюта,Регистратор.Дата);
				
				Запись.Цена		        =СредняяЦена.Цена;
				Запись.КроссКурс			=СредняяЦена.Валюта[Выборка.ВалютаОстаток].КроссКурс;
				
				Если  Запись.КроссКурс=1 Тогда
					Запись.ЦенаОстатокКрос=Выборка.ЦенаОстаток;
				Иначе
					
					Запись.ЦенаОстатокКрос  =СредняяЦена.Валюта[Выборка.ВалютаОстаток].КросЦена; 
					
				КонецЕсли;
				
			Иначе
				
				Запись.Цена					=Выборка.Цена;
				Запись.ЦенаОстатокКрос		=0;
				Запись.КроссКурс	=0;
				
			КонецЕсли;
			
		КонецЕсли;  
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	ДатаНачала = ДатаНачалаЗаписиРегистра_ЛикоЦеныГруппНоменклатуры();
	
	Если ДатаНачала<НаборЗаписей.Отбор.Регистратор.Значение.Дата Тогда
		
		
		Для каждого Запись Из НаборЗаписей Цикл
			
			ЗаписьРегистраЛико_ЦеныГруппыНоменклатуры(Запись.Регистратор,Запись); 
			
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
	
	
	
	ЗафиксироватьТранзакцию();	
КонецПроцедуры

Процедура ПересчитатьСтоимостьЦеновыхГрупп(Организация, Дата = Неопределено) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_УстановкаСтоимостиЦеновыхГрупп.Ссылка КАК Ссылка,
	|	Лико_УстановкаСтоимостиЦеновыхГрупп.Дата КАК Дата
	|ИЗ
	|	Документ.Лико_УстановкаСтоимостиЦеновыхГрупп КАК Лико_УстановкаСтоимостиЦеновыхГрупп
	|ГДЕ
	|	Лико_УстановкаСтоимостиЦеновыхГрупп.Организация = &Организация
	//|	И Лико_УстановкаСтоимостиЦеновыхГрупп.Проведен
	|	И Лико_УстановкаСтоимостиЦеновыхГрупп.Дата >= &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйОрдерНаТовары.Ссылка,
	|	ПриходныйОрдерНаТовары.Дата
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	|ГДЕ
	//|	ПриходныйОрдерНаТовары.Проведен
	|	 ПриходныйОрдерНаТовары.Распоряжение.Организация = &Организация
	|	И ПриходныйОрдерНаТовары.Распоряжение Ссылка Документ.ЗаказПоставщику
	//|	И ПриходныйОрдерНаТовары.Распоряжение.ХозяйственнаяОперация В(&МассивОпераций)
	|	И ПриходныйОрдерНаТовары.Дата >= &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйОрдерНаТовары.Ссылка,
	|	ПриходныйОрдерНаТовары.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Организация",Организация ); 
	Запрос.УстановитьПараметр("Дата",Дата ); 
	//Запрос.УстановитьПараметр("МассивОпераций",РегистрыСведений.Лико_АвтоРасчетЦенЦГ.ХозяйственныеОперации()); 



	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписатьСтоимтостьЦеновыхГрупп(Организация,Выборка.Ссылка);
	КонецЦикла; 




КонецПроцедуры

Функция ПолучитьВалютуЦенновойГруппы(Организация,ЦеноваяГруппа) Экспорт  
    УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ЦеноваяГруппа)=Тип("СправочникСсылка.Номенклатура") Тогда 
		  ЦеноваяГруппа=ЦеноваяГруппа.ЦеноваяГруппа;
	  КонецЕсли; 
	  
	  Если ТипЗнч(ЦеноваяГруппа)<>Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
		Возврат Справочники.Валюты.ПустаяСсылка();  
	  КонецЕсли;
	  
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Лико_СтоимостьЦеновыхГруппСрезПоследних.Валюта КАК Валюта
	 |ИЗ
	 |	РегистрСведений.Лико_СтоимостьЦеновыхГрупп.СрезПоследних(
	 |			,
	 |			Организация = &Организация
	 |				И ЦеноваяГруппа = &ЦеноваяГруппа) КАК Лико_СтоимостьЦеновыхГруппСрезПоследних";
	 Запрос.УстановитьПараметр("Организация", Организация); 
	  Запрос.УстановитьПараметр("ЦеноваяГруппа", ЦеноваяГруппа);

	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Выборка = РезультатЗапроса.Выбрать();
	 Пока Выборка.Следующий() Цикл
	      Возврат Выборка.Валюта;
	 КонецЦикла; 
	  
     Возврат Справочники.Валюты.ПустаяСсылка(); 
	

КонецФункции //-Лико m.shenderov 18.12.2023 

Функция ПолучитьВалютуЦеновойГруппыПоНоменклатуре(Организация,МассивНоменклатур) Экспорт  
		
УстановитьПривилегированныйРежим(Истина);	
	МассивЦГ = Новый Массив();
	
	Для каждого Номенклатура Из  МассивНоменклатур Цикл
		
		МассивЦГ.Добавить(?(ТипЗнч(Номенклатура)=Тип("СправочникСсылка.Номенклатура"),Номенклатура.ЦеноваяГруппа,Номенклатура)); 
		 	  		
	КонецЦикла;
		  
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Лико_СтоимостьЦеновыхГруппСрезПоследних.Валюта КАК Валюта,
	 |	Лико_СтоимостьЦеновыхГруппСрезПоследних.ЦеноваяГруппа КАК ЦеноваяГруппа
	 |ИЗ
	 |	РегистрСведений.Лико_СтоимостьЦеновыхГрупп.СрезПоследних(
	 |			,
	 |			Организация = &Организация
	 |				И ЦеноваяГруппа В (&МассивЦГ)) КАК Лико_СтоимостьЦеновыхГруппСрезПоследних";
	 Запрос.УстановитьПараметр("Организация", Организация); 
	  Запрос.УстановитьПараметр("МассивЦГ", МассивЦГ);

	 тзВалютаЦеновыхГрупп = Запрос.Выполнить().Выгрузить();
	 Соответствие = Новый Соответствие; 
	 
	 Для каждого Номенклатура Из МассивНоменклатур Цикл
		 
		 НС=тзВалютаЦеновыхГрупп.Найти(Номенклатура.ЦеноваяГруппа,"ЦеноваяГруппа");
		 
		 Если НС<>Неопределено И  Соответствие.Получить(Номенклатура)=Неопределено Тогда
			 
			 Соответствие.Вставить(Номенклатура,НС.Валюта);
			 
		 КонецЕсли;    
		 
		 
	 КонецЦикла;

	 Возврат Соответствие;
	 
КонецФункции //-Лико m.shenderov 18.12.2023 

Функция ПоказатьРазницуВЦенеСЦеновойГрупой(Организация,Дата,Валюта,Данные,РазницаПроцент=10) Экспорт  
	
	УстановитьПривилегированныйРежим(Истина);
	
	   Запрос = Новый Запрос;
	   Запрос.Текст = 
	   "ВЫБРАТЬ
	   |	ЗаказПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	   |	ЗаказПоставщикуТовары.Лико_ЦенаИтого КАК Цена,
	   |	&Валюта КАК Валюта,
	   |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура
	   |ПОМЕСТИТЬ ВтЦеныЗаказПоставщику2
	   |ИЗ
	   |	&Данные КАК ЗаказПоставщикуТовары
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ЗаказПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	   |	ЗаказПоставщикуТовары.Цена КАК Цена,
	   |	ЗаказПоставщикуТовары.Валюта КАК Валюта,
	   |	ЗаказПоставщикуТовары.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	   |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	   |	КурсыВалютСрезПоследних.Курс КАК Курс,
	   |	КурсыВалютСрезПоследних.Кратность КАК Кратность
	   |ПОМЕСТИТЬ ВтЦеныЗаказПоставщику
	   |ИЗ
	   |	ВтЦеныЗаказПоставщику2 КАК ЗаказПоставщикуТовары,
	   |	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа КАК ЦеноваяГруппа,
	   |	Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта КАК Валюта,
	   |	Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена КАК Цена,
	   |	КурсыВалютСрезПоследних.Курс КАК Курс,
	   |	КурсыВалютСрезПоследних.Кратность КАК Кратность
	   |ПОМЕСТИТЬ ВтЦенаЦГ
	   |ИЗ
	   |	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	   |			&Дата,
	   |			ТипЦен = &ТипЦен
	   |				И Площадка = &Площадка
	   |				И ЦеноваяГруппа В
	   |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	   |						ВтЦеныЗаказПоставщику.ЦеноваяГруппа КАК ЦеноваяГруппа
	   |					ИЗ
	   |						ВтЦеныЗаказПоставщику КАК ВтЦеныЗаказПоставщику)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
	   |		ПО Лико_ЦеныГруппНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ВтЦеныЗаказПоставщику.НомерСтроки КАК НомерСтроки,
	   |	ВтЦеныЗаказПоставщику.Цена КАК Цена,
	   |	ВтЦеныЗаказПоставщику.Валюта КАК Валюта,
	   |	ВтЦеныЗаказПоставщику.ЦеноваяГруппа КАК ЦеноваяГруппа,
	   |	ВтЦеныЗаказПоставщику.Номенклатура КАК Номенклатура,
	   |	ВтЦенаЦГ.Цена КАК ЦенаЦГ,
	   |	ВтЦенаЦГ.Валюта КАК ВалютаЦГ,
	   |	ВЫБОР
	   |		КОГДА ВтЦенаЦГ.Цена = 0
	   |			ТОГДА 100
	   |		ИНАЧЕ (ВтЦеныЗаказПоставщику.Цена * ВтЦеныЗаказПоставщику.Курс / ВтЦеныЗаказПоставщику.Кратность - ВтЦенаЦГ.Цена * ВтЦенаЦГ.Курс / ВтЦенаЦГ.Кратность) / (ВтЦенаЦГ.Цена * ВтЦенаЦГ.Курс / ВтЦенаЦГ.Кратность) * 100
	   |	КОНЕЦ КАК РазницаПроцент,
	   |	ВтЦеныЗаказПоставщику.Цена * ВтЦеныЗаказПоставщику.Курс / ВтЦеныЗаказПоставщику.Кратность - ВтЦенаЦГ.Цена * ВтЦенаЦГ.Курс / ВтЦенаЦГ.Кратность КАК Поле1,
	   |	ВтЦенаЦГ.Цена * ВтЦенаЦГ.Курс / ВтЦенаЦГ.Кратность КАК Поле2
	   |ПОМЕСТИТЬ ВтИтог
	   |ИЗ
	   |	ВтЦеныЗаказПоставщику КАК ВтЦеныЗаказПоставщику
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЦенаЦГ КАК ВтЦенаЦГ
	   |		ПО ВтЦеныЗаказПоставщику.ЦеноваяГруппа = ВтЦенаЦГ.ЦеноваяГруппа
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ВтИтог.НомерСтроки КАК НомерСтроки,
	   |	ВтИтог.Цена КАК Цена,
	   |	ВтИтог.Валюта КАК Валюта,
	   |	ВтИтог.ЦеноваяГруппа КАК ЦеноваяГруппа,
	   |	ВтИтог.Номенклатура КАК Номенклатура,
	   |	ВЫРАЗИТЬ(ВтИтог.РазницаПроцент КАК ЧИСЛО(9, 2)) КАК РазницаПроцент,
	   |	ВтИтог.ЦенаЦГ КАК ЦенаЦГ,
	   |	ВтИтог.ВалютаЦГ КАК ВалютаЦГ
	   |ИЗ
	   |	ВтИтог КАК ВтИтог
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_АвтоРасчетЦенЦГ.СрезПоследних(
	   |				&Дата,
	   |				Организация = &Площадка
	   |					И ЦеноваяГруппа В
	   |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	   |							ВтЦеныЗаказПоставщику.ЦеноваяГруппа КАК ЦеноваяГруппа
	   |						ИЗ
	   |							ВтЦеныЗаказПоставщику КАК ВтЦеныЗаказПоставщику)) КАК Лико_АвтоРасчетЦенЦГСрезПоследних
	   |		ПО ВтИтог.ЦеноваяГруппа = Лико_АвтоРасчетЦенЦГСрезПоследних.ЦеноваяГруппа
	   |ГДЕ
	   |	ВЫБОР
	   |			КОГДА ВтИтог.РазницаПроцент > 0
	   |				ТОГДА ВтИтог.РазницаПроцент >= &РазницаПроцент
	   |			ИНАЧЕ ВтИтог.РазницаПроцент * -1 >= &РазницаПроцент
	   |		КОНЕЦ
	   |	И Лико_АвтоРасчетЦенЦГСрезПоследних.АвтоРасчет";
	   Запрос.УстановитьПараметр("Дата",Дата );
	   Запрос.УстановитьПараметр("Данные",Данные );
	   Запрос.УстановитьПараметр("Площадка",Организация );  
	   Запрос.УстановитьПараметр("Валюта",Валюта ); 
	   Запрос.УстановитьПараметр("РазницаПроцент",РазницаПроцент );
       Запрос.УстановитьПараметр("ТипЦен",Перечисления.Лико_ТипЦен.ЦенаПоставщика );

	   Возврат Запрос.Выполнить().Выгрузить();
	   
	   
	 
	 
	 
 КонецФункции  

 Процедура ЗаписьРегистраЛико_ЦеныГруппыНоменклатуры(Регистратор,Запись) Экспорт 
	 
	 //Запись.Период 
	 //Запись.ЦеноваяГруппа
	 //Запись.Организация 
	 //Запись.Цена 
	 //Запись.Валюта 
	 
	 НаборЗаписейЦГ = РегистрыСведений.Лико_ЦеныГруппНоменклатуры.СоздатьНаборЗаписей();
	 НаборЗаписейЦГ.Отбор.Период.Установить(Запись.Период);
	 НаборЗаписейЦГ.Отбор.ТипЦен.Установить(Перечисления.Лико_ТипЦен.ЦенаПоставщика);
	 НаборЗаписейЦГ.Отбор.ЦеноваяГруппа.Установить(Запись.ЦеноваяГруппа);
	 НаборЗаписейЦГ.Отбор.Площадка.Установить(Запись.Организация);
	 
	 НоваяЗапись = НаборЗаписейЦГ.Добавить();
	 НоваяЗапись.Период = Запись.Период;
	 НоваяЗапись.ТипЦен = Перечисления.Лико_ТипЦен.ЦенаПоставщика;
	 НоваяЗапись.ЦеноваяГруппа = Запись.ЦеноваяГруппа;
	 НоваяЗапись.ЕдиницаИзмерения = НоваяЗапись.ЦеноваяГруппа.ОсновнаяНоменклатура.ЕдиницаИзмерения;
	 НоваяЗапись.Площадка = Запись.Организация; 
	 
	 НоваяЗапись.Цена = Запись.Цена;
	 НоваяЗапись.Валюта = Запись.Валюта;
	 НоваяЗапись.Основание = Регистратор;
	 НоваяЗапись.АвтоРасчетЦены = Истина;
	 //НоваяЗапись.Наценка = НаценкаПоДокументу(Регистратор);
	 НоваяЗапись.Ответственный = ОтветсвенныйПоДокументу(Регистратор); 
	 
	 ТЗЦеныГруппНоменклатурыНаДату =Лико_ЦеныГруппНоменклатурыНаДату(Запись.Период-1, Запись.Организация, Запись.ЦеноваяГруппа);
	 
	 Для каждого ЦГ Из ТЗЦеныГруппНоменклатурыНаДату Цикл
		 
		 ЗаполнитьЗначенияСвойств(НоваяЗапись,ЦГ);
		 
	 КонецЦикла;
	 
	Наценка = НаценкаПоДокументу(Регистратор); 
	 
	Если ЗначениеЗаполнено(Наценка) Тогда
		НоваяЗапись.Наценка = Наценка;	
	КонецЕсли;
	
	 
	 НаборЗаписейЦГ.Записать();
	 
	 
 КонецПроцедуры
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций                                                 77

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РассчитатьСреденеВзвешеннуюЦену(МассивЦен, Валюта, Дата)

	УстановитьПривилегированныйРежим(Истина);	
	Структура = Новый Структура;
	Структура.Вставить("Цена",0);
	Структура.Вставить("Валюта",Неопределено);
	Соответствие = Новый Соответствие;

	ЦенаКоличество=0;
	КоличествоВсего=0;

	Для каждого СтруктураЦены Из МассивЦен Цикл

		Если СтруктураЦены.Валюта<>Валюта Тогда

			Цена =	РаботаСКурсамиВалют.ПересчитатьВВалюту(СтруктураЦены.Цена, СтруктураЦены.Валюта,Валюта,Дата );

			Если  СтруктураЦены.Валюта.Лико_Рейтинг>=Валюта.Лико_Рейтинг Тогда
				КроссКурс=СтруктураЦены.Цена/Цена;
			Иначе
				КроссКурс=Цена/СтруктураЦены.Цена;							
			КонецЕсли; 
			КросЦена=Цена;	
		Иначе
			Цена=СтруктураЦены.Цена;
			КроссКурс=1;
			КросЦена=СтруктураЦены.Цена;
		КонецЕсли;

		Если Соответствие.Получить(СтруктураЦены.Валюта)= Неопределено Тогда
			Соответствие.Вставить(СтруктураЦены.Валюта,Новый Структура("КроссКурс,КросЦена",КроссКурс,КросЦена));
		КонецЕсли;

		ЦенаКоличество=ЦенаКоличество+(Цена*СтруктураЦены.Количество);
		КоличествоВсего=КоличествоВсего+СтруктураЦены.Количество;

	КонецЦикла;

	Если КоличествоВсего<>0 Тогда
		Структура.Цена= ЦенаКоличество/КоличествоВсего;
	КонецЕсли;

	Структура.Валюта=Соответствие;

	Возврат Структура; 
КонецФункции

Функция ДатаНачалаЗаписиРегистра_ЛикоЦеныГруппНоменклатуры()
	
	Дата = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаЗаписиРегистра_ЛикоЦеныГруппНоменклатурыИзСтоимостиЦеновыхГрупп.ЗначениеПараметра;
	
	Возврат Дата;
	
	//Возврат  Дата('2024.10.25');

КонецФункции 

 Функция Лико_ЦеныГруппНоменклатурыНаДату(Период, Организация, ЦеноваяГруппа) 
	 
	 Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Наценка КАК Наценка,
			|	Лико_ЦеныГруппНоменклатурыСрезПоследних.ПотериНаРезке КАК ПотериНаРезке,
			|	Лико_ЦеныГруппНоменклатурыСрезПоследних.СкладскиеРасходы КАК СкладскиеРасходы
			|ИЗ
			|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
			|			&Период,
			|			ЦеноваяГруппа = &ЦеноваяГруппа
			|				И ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ЦенаПоставщика)
			|				И Площадка = &Площадка) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних";
			Запрос.УстановитьПараметр("Период",Период );
			Запрос.УстановитьПараметр("Площадка",Организация); 
			Запрос.УстановитьПараметр("ЦеноваяГруппа",ЦеноваяГруппа);


			Возврат Запрос.Выполнить().Выгрузить();
			
				
 КонецФункции  
 
//Адаптер Ответсвенный 
 Функция ОтветсвенныйПоДокументу(Документ)
	 
	 Ответсвенный = Неопределено;
	 ОтветсвенныйПоДокументуПриходныйОрдер(Документ, Ответсвенный); 
	 ОтветсвенныйПоДокументуЛико_УстановкаСтоимостиЦеновыхГрупп(Документ, Ответсвенный);

	 Возврат Ответсвенный; 
 КонецФункции
 
 Процедура ОтветсвенныйПоДокументуПриходныйОрдер(Документ,Ответсвенный) 
	 
	 Если ЗначениеЗаполнено(Ответсвенный) 
		 Или  ТипЗнч(Документ) <> Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		 Возврат;
	 КонецЕсли;
	 
	 ОтветсвенныйПоДокументуЗаказПоставщику(Документ, Ответсвенный);
	 
	 
 КонецПроцедуры  
 Процедура ОтветсвенныйПоДокументуЗаказПоставщику(Документ,Ответсвенный) 
	 
	 Если ЗначениеЗаполнено(Ответсвенный) 
		 Или  ТипЗнч(Документ) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		 Возврат;
	 КонецЕсли;
	 
	 Ответственный = Документ.Менеджер;
	 
 КонецПроцедуры  
 Процедура ОтветсвенныйПоДокументуЛико_УстановкаСтоимостиЦеновыхГрупп(Документ,Ответсвенный) 
	 
	 Если ЗначениеЗаполнено(Ответсвенный) 
		 Или  ТипЗнч(Документ) <> Тип("ДокументСсылка.Лико_УстановкаСтоимостиЦеновыхГрупп") Тогда
		 Возврат;
	 КонецЕсли;
	 
	 Ответственный = Документ.Ответсвенный;
	 
 КонецПроцедуры  

 //Адаптер Ответсвенный  
 
 //Адаптер Наценка
 
 Функция НаценкаПоДокументу(Документ)
Наценка = 0;
 НаценкаПоДокументуЛико_УстановкаСтоимостиЦеновыхГрупп(Документ,Наценка); 

Возврат Наценка;
	 
 КонецФункции  

 
 Процедура НаценкаПоДокументуЛико_УстановкаСтоимостиЦеновыхГрупп(Документ,Наценка)
 
	 Если ЗначениеЗаполнено(Наценка) 
		 Или  ТипЗнч(Документ) <> Тип("ДокументСсылка.Лико_УстановкаСтоимостиЦеновыхГрупп") Тогда
		 Возврат;
	 КонецЕсли;
	 
	 Наценка = Документ.Наценка;
 
	 
	 
 КонецПроцедуры  
 
 
 
  //Адаптер Наценка
 

 Процедура УдалитьЗаписиВРегистреЛико_ЦеныГруппНоменклатурыПоОснованию(Основание)
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЦеныГруппНоменклатуры.Период КАК Период,
	|	Лико_ЦеныГруппНоменклатуры.ТипЦен КАК ТипЦен,
	|	Лико_ЦеныГруппНоменклатуры.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Лико_ЦеныГруппНоменклатуры.Площадка КАК Площадка
	|ИЗ
	|	РегистрСведений.Лико_ЦеныГруппНоменклатуры КАК Лико_ЦеныГруппНоменклатуры
	|ГДЕ
	|	Лико_ЦеныГруппНоменклатуры.Основание = &Основание";
	Запрос.УстановитьПараметр("Основание", Основание);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.Лико_ЦеныГруппНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.отбор.ТипЦен.Установить(Выборка.ТипЦен);
		НаборЗаписей.отбор.ЦеноваяГруппа.Установить(Выборка.ЦеноваяГруппа);
		НаборЗаписей.отбор.Площадка.Установить(Выборка.Площадка); 
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла; 
	
	 

КонецПроцедуры 

Процедура УдалитьЗаписиВРегистреЛико_СтоимостьЦеновыхГрупп(Регистратор)
	
	НаборЗаписей = РегистрыСведений.Лико_СтоимостьЦеновыхГрупп.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Записать(); 
	
	
КонецПроцедуры




 
#КонецОбласти

#КонецЕсли
